# Ссылка на сайт с расписанием
URL = 'http://inet.ibi.spb.ru/raspisan/rasp.php'

# Токен для бота вк
TOKEN = 'takyatebeiskazala'

# Инфа о БД
DB_NAME = 'echo'
DB_USER = 'nemnogo'
DB_PASSWORD = 'skrytoi'
DB_HOST = 'informacii'
DB_PORT = '5432'

# ЧП
TIME_ZONE = 'Europe/Moscow'

# Соответсвие дня недели по-русски номеру
WEEK = {
    "понедельник" : 1,
    "вторник" : 2,
    "среда" : 3,
    "четверг" : 4,
    "пятница" : 5,
    "суббота" : 6,
    "воскресенье" : 0,

    "пн" : 1,
    "вт" : 2,
    "ср" : 3,
    "чт" : 4,
    "пт" : 5,
    "сб" : 6,
    "вс" : 0
}

# Кодировка групп, придуманная программистами вуза
group_id = { 
    '101' : 2260,
    '102' : 2259,
    '103' : 2261,
    '104' : 2262,
    '105' : 2263,
    '106' : 2264,

    '160-1' : 2051,
    '170-1' : 2125,
    '171' : 2121,
    '172' : 2122,
    '173' : 2123,
    '180-1' : 2200,
    '181-1' : 2266,
    '181-2' : 2267,
    '182' : 2202,
    '191' : 2216,
    '192' : 2219,
    '193' : 2220,
    '21М-61' : 2077,
    '21М-71' : 2130,
    '21М-81' : 2199,
    '21М-91' : 2228,
    '21Э-61' : 2054,
    '21Э-71' : 2128,
    '21Э-72' : 2129,
    '21Э-73' : 2284,
    '21Э-81' : 2197,
    '21Э-91' : 2222,
    '21Э-92' : 2223,
    '27Э-74' : 2166,
    '51М-62' : 2098,
    '51М-71' : 2137,
    '51М-81' : 2208,
    '51М-91' : 2230,
    '51Э-71' : 2135,
    '51Э-72' : 2136,
    '51Э-81' : 2192,
    '51Э-82' : 2248,
    '51Э-91' : 2229
}